//#include <iostream>
//using namespace std;
//
//int d[100005];
//
//int main()
//{
//	ios::sync_with_stdio(0);
//	cin.tie(0);
//
//	int n;
//	cin >> n;
//
//	//d[1] = 1
//	//d[2] = 1 + 1
//	//d[3] = 1 + 1 + 1
//	
//	//d[4] = 2*2
//	//d[5] = 2*2 + 1
//	//d[6] = 2*2 + 1 + 1
//	//d[7] = 2*2 + 1 + 1 + 1
//	
//	//d[8] = 2*2 + 2*2
//	
//	//d[9] = 3*3
//	//d[10] = 3*3 + 1
//	//d[11] = 3*3 + 1 + 1
//	
//	//제곱수 넘어갈때마다 d업데이트
//	for (int i = 1; i <= n; ++i)
//	{
//		d[i] = i;
//		for (int j = 1; j * j <= i; ++j)
//			d[i] = min(d[i], d[i - j * j] + 1);
//	}
//	cout << d[n];
//}